const s = `

EVENT LOOP :
ایونت لوپ یک حلقه بی نهایت هست که توسط موتور پردازنده جاوااسکریپت ایجاد 
میشه . در این پروسه موتور منتظر اومدن تسک ها هست و وقتی تسکی بیاد اون رو
انجام میده.

وقتی که موتور مشغول پردازش و اجرای یک تسک هست اگر تسک دیگه ای وارد بشه موتور اون رو میفرسته داخل یک صف
و وقتی تسک فعلی به اتمام برسه میره سراغ قدیمی ترین تسکی که وارد صف شده.

MACROTASK QUEUE :
به این صف "صف ماکروتسک" گفته میشه 

نکته :
زمانی که مرورگر در حال انجام یک تسک باشد تسک دیگری نمیپذیرد
مثلا اگر یک حلقه بسازیم که از صفر تا 1 میلیارد بشماره ، موتور جاوااسکریپت
تا زمانی که این حلقه به پایان نرسه ابدا حتی اگه روی چیزیکلیک سا هاور کنیم انجامش نمیده و اون تسک رو میفرسته به صف.
همه این بدبختی ها بخاطر سینگل ترد بون هست .


`;
